#+STARTIOP: overview 
* Tab indent
#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil) ; tab 改为插入空格

(setq c-basic-offset 4) ; c c++ 缩进4个空格

(setq c-default-style "linux"); 没有这个 { } 就会瞎搞

(setq default-tab-width 4)
#+END_SRC

#+RESULTS:
: 4

